[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:56:27
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
-                required: "Requester's Email is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester's Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:93:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "Table or Breakout Room # is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room # is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestForm.js:151:27
               id="solved"
               isInvalid={Boolean(errors.solved)}
               {...register("solved", {
-                validate: (value) =>
-                  value === "true" ||
-                  value === "false" ||
-                  value === true ||
-                  value === false ||
-                  "Solved is required.",
+                validate: () => undefined,
               })}
             >
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:152:19
               isInvalid={Boolean(errors.solved)}
               {...register("solved", {
                 validate: (value) =>
-                  value === "true" ||
-                  value === "false" ||
-                  value === true ||
+                  (value === "true" || value === "false") && value === true ||
                   value === false ||
                   "Solved is required.",
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:152:19
               isInvalid={Boolean(errors.solved)}
               {...register("solved", {
                 validate: (value) =>
-                  value === "true" ||
-                  value === "false" ||
+                  value === "true" && value === "false" ||
                   value === true ||
                   value === false ||
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:153:19
               {...register("solved", {
                 validate: (value) =>
                   value === "true" ||
-                  value === "false" ||
+                  value !== "false" ||
                   value === true ||
                   value === false ||
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:153:19
               {...register("solved", {
                 validate: (value) =>
                   value === "true" ||
-                  value === "false" ||
+                  false ||
                   value === true ||
                   value === false ||
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:154:19
                 validate: (value) =>
                   value === "true" ||
                   value === "false" ||
-                  value === true ||
+                  value !== true ||
                   value === false ||
                   "Solved is required.",
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:154:19
                 validate: (value) =>
                   value === "true" ||
                   value === "false" ||
-                  value === true ||
+                  false ||
                   value === false ||
                   "Solved is required.",

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:155:19
                   value === "true" ||
                   value === "false" ||
                   value === true ||
-                  value === false ||
+                  value !== false ||
                   "Solved is required.",
               })}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:155:29
                   value === "true" ||
                   value === "false" ||
                   value === true ||
-                  value === false ||
+                  value === true ||
                   "Solved is required.",
               })}
